interactions:
- request:
    body: null
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate, zstd
      Connection:
      - keep-alive
      User-Agent:
      - python-lokalise-api plugin/4.0.6
      x-api-token:
      - FILTERED
    method: GET
    uri: https://api.lokalise.com/v1/audit-logs
  response:
    body:
      string: '{"data":[{"class_uid":6003,"class_name":"API Activity","category_uid":6,"category_name":"Application
        Activity","activity_id":99,"activity_name":"Other","type_uid":600399,"severity_id":1,"severity":"Informational","status_id":1,"status":"Success","time":1753267304,"metadata":{"uid":"6880bc681710af8df90f007c","version":"1.3.0","log_provider":"lokalise-audit","event_code":"project.deleted","product":{"vendor_name":"Lokalise","name":"Lokalise
        Expert","version":1}},"actor":{"user":{"uid":"20181","type_id":1},"session":{"is_remote":true}},"src_endpoint":{"ip":"1.1.1.1"},"http_request":{"user_agent":"Mozilla\/5.0
        (Windows NT 10.0; Win64; x64; rv:140.0) Gecko\/20100101 Firefox\/140.0","url":{"url_string":"https:\/\/app.lokalise.com\/project\/delete"}},"enrichments":[{"name":"team","value":"Ilya\u0027s
        Team - @ai-scoring","data":{"id":176692,"name":"Ilya\u0027s Team - @ai-scoring"}},{"name":"project","value":"iOS
        GH","data":{"id":"2853102668763e85e45176.50644855","name":"iOS GH"}}],"unmapped":{"event_group_id":0,"event_type_id":1006,"api_call":false,"data":{"name":"iOS
        GH","description":""}}},{"class_uid":6003,"class_name":"API Activity","category_uid":6,"category_name":"Application
        Activity","activity_id":99,"activity_name":"Other","type_uid":600399,"severity_id":1,"severity":"Informational","status_id":1,"status":"Success","time":1753267317,"metadata":{"uid":"6880bc75a4474d555400f17b","version":"1.3.0","log_provider":"lokalise-audit","event_code":"project.deleted","product":{"vendor_name":"Lokalise","name":"Lokalise
        Expert","version":1}},"actor":{"user":{"uid":"20181","type_id":1},"session":{"is_remote":true}},"src_endpoint":{"ip":"1.1.1.1"},"http_request":{"user_agent":"Mozilla\/5.0
        (Windows NT 10.0; Win64; x64; rv:140.0) Gecko\/20100101 Firefox\/140.0","url":{"url_string":"https:\/\/app.lokalise.com\/project\/delete"}},"enrichments":[{"name":"team","value":"Ilya\u0027s
        Team - @ai-scoring","data":{"id":176692,"name":"Ilya\u0027s Team - @ai-scoring"}},{"name":"project","value":"AI
        translations","data":{"id":"70713459686cfb3cb2d834.86315843","name":"AI translations"}}],"unmapped":{"event_group_id":0,"event_type_id":1006,"api_call":false,"data":{"name":"AI
        translations","description":""}}}],"next_cursor":"eyJpZCI6IjY5YjQxNTg4ZGExMDM1MTkyMDBkZTg2YSJ9","has_more":true}'
    headers:
      Connection:
      - keep-alive
      Content-Type:
      - application/json
      Date:
      - Wed, 22 Jul 2026 13:18:45 GMT
      Transfer-Encoding:
      - chunked
      cache-control:
      - no-store, no-cache, must-revalidate,max-age=0, must-revalidate, private
      content-encoding:
      - zstd
      expires:
      - Wed, 22 Jul 2026 13:18:45 GMT
      pragma:
      - no-cache
      referrer-policy:
      - origin
      server:
      - nginx
      strict-transport-security:
      - max-age=31536000
      vary:
      - Accept-Encoding
      x-content-type-options:
      - nosniff
      x-frame-options:
      - deny
      x-lokalise-process-id:
      - fcca32ba-8591-4a57-b94d-eb5cc75e970f
      x-ratelimit-limit:
      - 10, 10;w=1, 10;w=1
      x-ratelimit-remaining:
      - '9'
      x-ratelimit-reset:
      - '1'
      x-xss-protection:
      - 1; mode=block
    status:
      code: 200
      message: OK
version: 1
